# Шаг №4 - Первая игра - "Однорукий бандит"

## Для чего выполнять это задание

Задание спроектировано для Вашей тренировки в операторном программировании, так что в нём нужно постараться обойтись исключительно `entrypoint`-методом (`public static void main`) - те из Вас, кто считает, что владеет программированием в процедурном, ООП и функциональном стиле, потерпите и постарайтесь себя сдерживать - задание достаточно простое, чтобы можно было обойтись без этого и решить задачу, сосредоточившись исключительно на операторах и примитивных типах.

Не переживайте - процедурный подход у нас начнётся со следующего шага, ООП - со второго проекта, а функциональный подход будет возможность попрактиковать в третьем проекте.

## Что должно получиться
Пример был дан в описании - нужно сделать игру, в которой будет происходить кручение 3-х барабанов и, если значения совпадут - выплачивать виртуальный выигрыш.

## Как выполнять задание

Нужно вместо использовавшегося нами до этого простенького кода-заглушки `System.out.println("Hello, World!");` написать программу, которая эмулирует игру на автомате "однорукий бандит".

Несколько ограничений:  
   * Игра должна быть совершенно автоматической и выполняться без пользователя - об интерактивности позаботимся чуть позже - в 3-ем проекте.  
   * В начале игры у игрока в наличии должна быть определённая сумма виртуальных денег, которую он может себе позволить проиграть. Игра заканчивается, когда он всё проиграет и ему нечего будет ставить.  
      - Давайте возьмём 100$.  
      - Каждый раунд будем ставить по 10$, таким образом, если мы всё время будем проигрывать, то всего сыграем 10 раз.
      - В случае выигрыша давайте считать что мы выиграли 1000$ - их нужно будет добавлять к виртуальным деньгам пользователя и играть на них снова.  
   * Игра заключается в кручении барабанов и проверке результата на совпадение итоговых значений.  
      - Обычные offline\`овые барабаны содержат прикольные картинки, но т.к. у нас не стоит задача визуализировать процесс, так что нет нужды как-то выделять значения, так что для нас они - просто цифры, которые вычисляются и сопоставляются.  
      - Предлагается эмулировать барабаны при помощи 7-и различных значений.  
      - Сделайте 3 барабана  
   * Введём понятие _усилия_ - это случайная величина, на которую проворачивается барабан. Измеряется в кол-ве прокрученных позиций.  
      - Исходите из минимального значения 0, максимального - 100.  
   * Для того, чтобы определить случайное усилие, вам понадобится генератор случайных чисел. В Java есть более удобные классы, но для начала нужно научиться использовать простейший инструментарий, так что используйте метод `Math.random()`.  
      - Он выдаёт случайное дробное число в диапазоне от 0 до 1. Так что, для того, чтобы получить случайное целое в диапазоне от 0 до 100, нужно умножить его на 100 и...  
      - Округлить результат. Для этого в Java есть стандартный метод `Math.round(double d)`. Проблема заключается в том, что он возвращает тип `long`, а не `int`.  
         + Long не так удобно использовать в Java, поскольку он не является числовым типом по умолчанию. Так что нам нужно преобразовать результат округления в тип `int` явно - это делается при помощи т.н. casting`а
      - Выглядит это так: (int) Math.round(Math.random() * 100)
   * Усилие обозначает кол-во элементов, на которые прокрутится барабан.
      - Т.к. усилие может быть намного больше, чем кол-во элементов на барабане, в действие вступает его округлость, т.е. после последнего (7-го) элемента снова должен идти первый.  
      - Добиться этого легче всего при помощи операции получения остатка от деления н**а**цело - `%`. Мы просто прибавляем к текущему положению барабана усилие (полученное по формуле выше) и от всего этого вместе получаем остаток от деления на кол-во делений барабана - т.е. на 7. Для счётчика первого барабана это будет выглядеть так:
      
            firstCounter = (firstCounter + (int) round(random() * 100)) % size;
   * С логгированием мы пока не знакомы, поэтому будем выводить содержимое при помощи стандартного метода вывода на консоль: `System.out.println("выводимый текст")`.  
      - необходимо выводить всю информацию на каждой итерации - сколько у пользователя денег, что выпало на барабанах, сколько он выиграл или проиграл и т.д.
      - Вот вариант возможного вывода программы, который должен у Вас получиться:
      
            У Вас 100$, ставка - 10$
            Крутим барабаны!Розыгрыш принёс следующие результаты:
            первый барабан - 3, второй - 3, третий - 6
            Проигрыш 10$, ваш капитал теперь составляет: 90$
            У Вас 90$, ставка - 10$
            Крутим барабаны!Розыгрыш принёс следующие результаты:
            первый барабан - 4, второй - 3, третий - 2
            Проигрыш 10$, ваш капитал теперь составляет: 80$
            ...
            У Вас 20$, ставка - 10$
            Крутим барабаны!Розыгрыш принёс следующие результаты:
            первый барабан - 6, второй - 0, третий - 3
            Проигрыш 10$, ваш капитал теперь составляет: 10$
            У Вас 10$, ставка - 10$
            Крутим барабаны!Розыгрыш принёс следующие результаты:
            первый барабан - 4, второй - 1, третий - 4
            Проигрыш 10$, ваш капитал теперь составляет: 0$  
   * Возможна вероятность зайти в бесконечный цикл - это нормально, т.к. мы действительно можем выигрывать несколько раз подряд. В этом случае программу придётся принудительно останавливать - это делается при помощи сочетания клавиш `Ctrl+C`
      - Конечно, это является не самым красивым решением и в продакшн-проекте такое было бы недопустимо (там следовало бы либо дать пользователю возможность остановить игру, введя элемент интерактивности, либо выходя из игры по тайм-ауту или после определённого максимально-возможного кол-ва попыток), но у нас пример учебный, так что пока не стоит об этом думать.   
   
Когда сделаете - пуште всё, что сделали, в GitHub, не забудьте отметить задание как выполненное, немного передохните и приступайте к следующему шагу!
